{
  "main_frame": {
    "select_model": "Select a folder containing the model for predictions.",
    "select_files": "Select the images you want to predict. You can choose multiple files at once. Only image file types will be accepted",
    "predict_all": "Predict all the images in the slideshow using the model selected.",
    "clear_images": "Clear all images from the slide show. If clear data on clear images setting is on, then this will clear the predicted data as well.",
    "help": "Opens the help page which contains information about the program.",
    "excel window": "Opens the excel window which contains basic functions for exporting and loading excel files, as well as advanced settings for column ordering.",
    "settings_window": "Opens the settings page which contains customizable settings for the program."
  },
  "excel_window": {
    "export_to_excel": "Exports the data in the predictions to a new excel file or appends to an existing excel file. If a new file is created than the program will load the new file into the program.",
    "load_excel": "Loads an excel file into the program to append predictions to it. Export to excel will not create a new file if a file is loaded into the program.",
    "clear_predictions": "Manually clears all predictions from the program.",
    "clear_excel_file": "Removes the loaded excel file from the program.",
    "excel_index_column": "Sets the order of the index column in the excel file. If 'None' is selected, the column will not be included.",
    "excel_date_column": "Sets the order of the date column in the excel file. If 'None' is selected, the column will not be included.",
    "excel_time_column": "Sets the order of the time column in the excel file. If 'None' is selected, the column will not be included.",
    "excel_file_name_column": "Sets the order of the file name column in the excel file. If 'None' is selected, the column will not be included.",
    "excel_total_count_column": "Sets the order of the total count column in the excel file. If 'None' is selected, the column will not be included.",
    "excel_file_name_field":"This is a field to enter the name of the file to save progress to, it will be populated with the current excel file name upon start up, if there is none then there is no file loaded into the program.",
    "save_excel_file_name": "Saves the excel file name into the program. The name will be collected from the matching field. The file will be created after exporting the data.",
    "output_folder_name_field": "This is a field to enter a new name for the output folder. It will be populated with the current output folder name upon start up pending on the save settings being on., If there is no saved output folder name then it will default to output.",
    "save_output_folder_name": "Saves the output folder name into the program. The name will be collected from the matching field. The folder will be created after exporting the data."
  },
  "settings": {
    "automatic_export_to_excel": "If turned on, data will automatically export to a new or current excel file after the predict all button is clicked. All settings autosave on toggle",
    "automatic_clear_data_on_predict": "If turned on, data will automatically be cleared after the predict all button is pressed. All settings autosave on toggle",
    "clear_data_when_clearing_images": "If turned on, predictions will be cleared after the clear images button is clicked. All settings autosave on toggle",
    "save_images_to_output" : "If turned on, images will be saved to the output folder after the predict all button is clicked. Loading the program with this setting on will enable two screens instead of one. Predictions will be twice as fast with this button off. All settings autosave on toggle",
    "reset_to_default_settings" : "Resets all settings to default. the Default settings are as follows: automatic export ot excel off, automatic clear data on predict off, clear data on clear images on, save images to output off.",
    "save_model_selection" : "Saves the current model selection into the program. If the model is a selected folder not recognized by the program, then user model will be displayed in the adjacent field. If the load settings are on, this model will be selected upon start up of the program. If the model folder is not detected by the program upon startup, the selection will be cleared from the save file.",
    "model_selection_label" : "This label will display the model saved into the program. If the label is none then no model is currently loaded into the program.",
    "clear_model_selection" : "Clears the current model selection from the save file. The label will reset to none.",
    "save_excel_file" : "Saves the current excel file into the program. This can save the name of an excel file before export. If the current name saved is not found during startup, the file will reset to none. AKA if the file does not exist then it will not be loaded into the program.",
    "excel_file_label" : "This label will display the excel file saved into the program. If the label is none then no excel file is currently loaded into the program.",
    "clear_excel_file" : "Clears the current excel file from the save file. The label will reset to none.",
    "save_output_folder" : "Saves the current output folder into the program. If the current name saved is not found during startup, the folder will reset to output. AKA if the folder does not exist then it will not be loaded into the program.",
    "output_folder_label" : "This label will display the output folder saved into the program. If the label is none then no output folder is currently loaded into the program.",
    "clear_output_folder" : "Clears the current output folder from the save file. The label will reset to output.",
    "load_save_settings_on_startup": "Load settings on startup toggle. Select to toggle. If this is turned on then the settings above will load into the program on startup. If the setting is turned off then all settings will be visible but they will not be loaded into the program on startup.",
    "clear_save_settings": "Clears all settings from the save file. Excel file and model selection will be set to none. Output folder will be set to output.",
    "check_version": "This button will check to see if there is a new version available on github. If there is, a prompt will display asking if you want to update your version and will navigate you to the github page. It will display that you are up to date if you have the latest version. It will say you do not have internet if the button cannot load google.com, which is our test to see if your internet works.",
    "user_guide": "This button will open the user guide page on the github. If you cannot load google then the button will let you know that you do not have internet."
  }
}
